# Lab 05: Merging and Joining Data (10 Bonus Points!)

This lab is presented with some revisions from [Dennis Sun at Cal Poly](https://web.calpoly.edu/~dsun09/index.html) and his [Data301 Course](http://users.csc.calpoly.edu/~dsun09/data301/lectures.html)

### When you have filled out all the questions, submit via [Tulane Canvas](https://tulane.instructure.com/)

In many situtions, the information you need is spread across multiple data sets, so you will need to combine multiple data sets into one. In this chapter, we explore how to combine information from multiple (tabular) data sets.

As a working example, we will use the baby names data collected by the Social Security Administration. Each data set in this collection contains the names of all babies born in the United States in a particular year. This data is [publicly available](https://www.ssa.gov/OACT/babynames/limits.html), and a copy has been made available at `../data/names.zip`.

**Note:** You will need to unzip this data into the directory where you are working to complete this lab!

**Note:** If you are on a windows machine the command below won't work quite right, don't worry about it!

In [1]:
import os
os.listdir(os.path.join("..","data","names"))

['names.zip',
 'NationalReadMe.pdf',
 'yob1880.txt',
 'yob1881.txt',
 'yob1882.txt',
 'yob1883.txt',
 'yob1884.txt',
 'yob1885.txt',
 'yob1886.txt',
 'yob1887.txt',
 'yob1888.txt',
 'yob1889.txt',
 'yob1890.txt',
 'yob1891.txt',
 'yob1892.txt',
 'yob1893.txt',
 'yob1894.txt',
 'yob1895.txt',
 'yob1896.txt',
 'yob1897.txt',
 'yob1898.txt',
 'yob1899.txt',
 'yob1900.txt',
 'yob1901.txt',
 'yob1902.txt',
 'yob1903.txt',
 'yob1904.txt',
 'yob1905.txt',
 'yob1906.txt',
 'yob1907.txt',
 'yob1908.txt',
 'yob1909.txt',
 'yob1910.txt',
 'yob1911.txt',
 'yob1912.txt',
 'yob1913.txt',
 'yob1914.txt',
 'yob1915.txt',
 'yob1916.txt',
 'yob1917.txt',
 'yob1918.txt',
 'yob1919.txt',
 'yob1920.txt',
 'yob1921.txt',
 'yob1922.txt',
 'yob1923.txt',
 'yob1924.txt',
 'yob1925.txt',
 'yob1926.txt',
 'yob1927.txt',
 'yob1928.txt',
 'yob1929.txt',
 'yob1930.txt',
 'yob1931.txt',
 'yob1932.txt',
 'yob1933.txt',
 'yob1934.txt',
 'yob1935.txt',
 'yob1936.txt',
 'yob1937.txt',
 'yob1938.txt',
 'yob1939.txt',
 'yob1940.txt',
 'yob1941.txt',
 'yob1942.txt',
 'yob1943.txt',
 'yob1944.txt',
 'yob1945.txt',
 'yob1946.txt',
 'yob1947.txt',
 'yob1948.txt',
 'yob1949.txt',
 'yob1950.txt',
 'yob1951.txt',
 'yob1952.txt',
 'yob1953.txt',
 'yob1954.txt',
 'yob1955.txt',
 'yob1956.txt',
 'yob1957.txt',
 'yob1958.txt',
 'yob1959.txt',
 'yob1960.txt',
 'yob1961.txt',
 'yob1962.txt',
 'yob1963.txt',
 'yob1964.txt',
 'yob1965.txt',
 'yob1966.txt',
 'yob1967.txt',
 'yob1968.txt',
 'yob1969.txt',
 'yob1970.txt',
 'yob1971.txt',
 'yob1972.txt',
 'yob1973.txt',
 'yob1974.txt',
 'yob1975.txt',
 'yob1976.txt',
 'yob1977.txt',
 'yob1978.txt',
 'yob1979.txt',
 'yob1980.txt',
 'yob1981.txt',
 'yob1982.txt',
 'yob1983.txt',
 'yob1984.txt',
 'yob1985.txt',
 'yob1986.txt',
 'yob1987.txt',
 'yob1988.txt',
 'yob1989.txt',
 'yob1990.txt',
 'yob1991.txt',
 'yob1992.txt',
 'yob1993.txt',
 'yob1994.txt',
 'yob1995.txt',
 'yob1996.txt',
 'yob1997.txt',
 'yob1998.txt',
 'yob1999.txt',
 'yob2000.txt',
 'yob2001.txt',
 'yob2002.txt',
 'yob2003.txt',
 'yob2004.txt',
 'yob2005.txt',
 'yob2006.txt',
 'yob2007.txt',
 'yob2008.txt',
 'yob2009.txt',
 'yob2010.txt',
 'yob2011.txt',
 'yob2012.txt',
 'yob2013.txt',
 'yob2014.txt',
 'yob2015.txt',
 'yob2016.txt',
 'yob2017.txt',
 'yob2018.txt']

As you can see this data is broken up into a lot of individual files, but if we want to use any of our `groupby` and other analysis techniques we need to make it into one file!

## Concatenation

Sometimes, the _rows_ of data are spread across multiple files, and we want to combine the rows into a single data set. The process of combining rows from different data sets is known as **concatenation**. Visually, to concatenate two or more `DataFrame`s means to stack them on top of one another.

<img src="../images/concatenate.png" width="400">

For example, suppose we want to understand how the popularity of different names evolved between 1995 and 2015. The 1995 names and the 2015 names are stored in two different files: `yob1995.txt` and `yob2015.txt`, respectively. To carry out this analysis, we will need to combine these two data sets into one.

In [2]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

# These two things are for Pandas, 
#it widens the notebook and lets us display data easily.
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:95% !important; }</style>"))

# Show a ludicrus number of rows and columns
pd.options.display.max_rows = 500
pd.options.display.max_columns = 500
pd.options.display.width = 1000

names1995 = pd.read_csv("../data/names/yob1995.txt",
                        header=None,
                        names=["Name", "Sex", "Count"])
names1995.head()

       Name Sex  Count
0   Jessica   F  27938
1    Ashley   F  26602
2     Emily   F  24380
3  Samantha   F  21644
4     Sarah   F  21383

In [3]:
names2015 = pd.read_csv("../data/names/yob2015.txt",
                        header=None,
                        names=["Name", "Sex", "Count"])
names2015.head()

       Name Sex  Count
0      Emma   F  20455
1    Olivia   F  19691
2    Sophia   F  17417
3       Ava   F  16378
4  Isabella   F  15617

To concatenate the two, we use the `pd.concat()` function, which accepts a _list_ of `pandas` objects (`DataFrames` or `Series`) and concatenates them.

In [4]:
pd.concat([names1995, names2015])

           Name Sex  Count
0       Jessica   F  27938
1        Ashley   F  26602
2         Emily   F  24380
3      Samantha   F  21644
4         Sarah   F  21383
...         ...  ..    ...
33116    Zykell   M      5
33117    Zyking   M      5
33118     Zykir   M      5
33119     Zyrus   M      5
33120      Zyus   M      5

[59201 rows x 3 columns]

There are two problems with the combined data set above. First, there is no longer any way to distinguish the 1995 data from the 2015 data. To fix this, we can add a "Year" column to each `DataFrame` before we concatenate. Second, the indexes from the individual `DataFrame`s have been preserved. (To see this, observe that the last index in the `DataFrame` is 32,951, which corresponds to the number of rows in `names2015`, but there are actually 59,032 rows in the `DataFrame`.) That means that there are two rows with an index of 0, two rows with an index of 1, and so on. To force `pandas` to create a completely new index for this `DataFrame`, ignoring the indices from the individual `DataFrame`s, we specify `ignore_index=True`.

In [5]:
names1995["Year"] = 1995
names2015["Year"] = 2015
names = pd.concat([names1995, names2015], ignore_index=True)
names

           Name Sex  Count  Year
0       Jessica   F  27938  1995
1        Ashley   F  26602  1995
2         Emily   F  24380  1995
3      Samantha   F  21644  1995
4         Sarah   F  21383  1995
...         ...  ..    ...   ...
59196    Zykell   M      5  2015
59197    Zyking   M      5  2015
59198     Zykir   M      5  2015
59199     Zyrus   M      5  2015
59200      Zyus   M      5  2015

[59201 rows x 4 columns]

Now this is a `DataFrame` that we can use!

Notice that the data is currently in tabular form, with one row per combination of name, sex, and year. It makes sense to set these to be the index of our `DataFrame`.

In [6]:
names.set_index(["Name", "Sex", "Year"], inplace=True)
names.head()

                   Count
Name     Sex Year
Jessica  F   1995  27938
Ashley   F   1995  26602
Emily    F   1995  24380
Samantha F   1995  21644
Sarah    F   1995  21383

We may want to show the counts for the two years side by side. In other words, we want a data cube with (name, sex) along one axis and year along the other. To do this, we can `.unstack()` the year from the index.  Note this is similar to a reverse Melt operation that we talked about in class -- a more tidy data way to do this may be to setup year as a multi index.

In [7]:
names.unstack("Year").head()

              Count
Year           1995  2015
Name      Sex
Aaban     M     NaN  15.0
Aabha     F     NaN   7.0
Aabriella F     NaN   5.0
Aada      F     NaN   5.0
Aadam     M     6.0  22.0

The `NaN`s simply indicate that there were no children (more precisely, if you read [the documentation](https://www.ssa.gov/OACT/babynames/limits.html), fewer than five children) born in the United States in that year. In this case, it makes sense to fill these `NaN` values with 0.

In [8]:
names.unstack().fillna(0).head()

              Count
Year           1995  2015
Name      Sex
Aaban     M     0.0  15.0
Aabha     F     0.0   7.0
Aabriella F     0.0   5.0
Aada      F     0.0   5.0
Aadam     M     6.0  22.0

# Merging (a.k.a. Joining)

More commonly, the data sets that we want to combine actually contain different information about the same observations. In other words, instead of stacking the `DataFrame`s on top of each other, as in concatenation, we want to stack them next to each other. The process of combining columns or variables from different data sets is known as **merging** or **joining**.

<img src="../images/merge.png" width="400">

The observations in the two data sets may not be in the same order, so merging is not as simple as stacking the `DataFrame`s side by side. For example, the process might look as follows:

![](../images/one-to-one.png)

In _pandas_, merging is accomplished using the `.merge()` function. We have to specify the variable(s) that we want to match across the two data sets. For example, to merge the 1995 names with the 2015 names, we have to join on name and sex.

In [9]:
names1995.merge(names2015, on=["Name", "Sex"]).head()

       Name Sex  Count_x  Year_x  Count_y  Year_y
0   Jessica   F    27938    1995     1587    2015
1    Ashley   F    26602    1995     3424    2015
2     Emily   F    24380    1995    11786    2015
3  Samantha   F    21644    1995     5340    2015
4     Sarah   F    21383    1995     4521    2015

The variables `Name` and `Sex` that we joined on each appear once in the resulting `DataFrame`. The variable `Count`, which we did not join on, appears twice---since there are columns called `Count` in both `DataFrame`s. Notice that `pandas` automatically appended the suffix `_x` to the name of the variable from the left data set and `_y` to the name from the right. We can customize the suffixes by specifying the `suffixes=` argument.

In [10]:
names1995.merge(names2015, on=["Name", "Sex"], suffixes=("1995", "2015")).head()

       Name Sex  Count1995  Year1995  Count2015  Year2015
0   Jessica   F      27938      1995       1587      2015
1    Ashley   F      26602      1995       3424      2015
2     Emily   F      24380      1995      11786      2015
3  Samantha   F      21644      1995       5340      2015
4     Sarah   F      21383      1995       4521      2015

In the code above, we assumed that the columns that we joined on had the same names in the two data sets. What if they had different names? For example, suppose the columns had been lowercase in one and uppercase in the other. We can specify which variables to use from the left and right data sets using the `left_on=` and `right_on=` arguments.

In [11]:
# Create new DataFrames where the column names are different
names1995_lower = names1995.copy()
names2015_upper = names2015.copy()
names1995_lower.columns = names1995.columns.str.lower()
names2015_upper.columns = names2015.columns.str.upper()

# This is how you merge them.
names1995_lower.merge(
    names2015_upper,
    left_on=("name", "sex"),
    right_on=("NAME", "SEX")
).head()

       name sex  count  year      NAME SEX  COUNT  YEAR
0   Jessica   F  27938  1995   Jessica   F   1587  2015
1    Ashley   F  26602  1995    Ashley   F   3424  2015
2     Emily   F  24380  1995     Emily   F  11786  2015
3  Samantha   F  21644  1995  Samantha   F   5340  2015
4     Sarah   F  21383  1995     Sarah   F   4521  2015

Note that here we've managed to get some redundant columns so we would need to drop these to keep our data tidy!

What if the "variables" that we want to join on are in the index? We can always call `.reset_index()` to make them columns, but we can also specify the arguments `left_index=True` or `right_index=True` to force `pandas` to use the index instead of columns.  Note that if we were to use the Pandas `join` command the default action would be to join on the indicies.

In [12]:
names1995_idx = names1995.set_index(["Name", "Sex"])
names1995_idx.head()

              Count  Year
Name     Sex
Jessica  F    27938  1995
Ashley   F    26602  1995
Emily    F    24380  1995
Samantha F    21644  1995
Sarah    F    21383  1995

In [13]:
names1995_idx.merge(names2015, left_index=True, right_on=("Name", "Sex")).head()

     Count_x  Year_x      Name Sex  Count_y  Year_y
205    27938    1995   Jessica   F     1587    2015
84     26602    1995    Ashley   F     3424    2015
7      24380    1995     Emily   F    11786    2015
39     21644    1995  Samantha   F     5340    2015
56     21383    1995     Sarah   F     4521    2015

Note that this worked because the left `DataFrame` had an index with two levels, which were joined to two columns from the right `DataFrame`.

# One-to-One and Many-to-One Relationships

In the example above, there was at most one (name, sex) combination in the 2015 data set for each (name, sex) combination in the 1995 data set. These two data sets are thus said to have a **one-to-one relationship**. Another example of a one-to-one data set is the Beatles example from above. Each Beatle appears in each data set exactly once, so the name is uniquely identifying.

![](../images/one-to-one.png)

However, two data sets need not have a one-to-one relationship. For example, a data set that specifies the instrument(s) that each Beatle played would potentially feature each Beatle multiple times (if they played multiple instruments). If we joined this data set to the "Beatles career" data set, then each row in the "Beatles career" data set would be mapped to several rows in the "instruments" data set. These two data sets are said to have a **many-to-one relationship**.

![](../images/many-to-one.png)

# Many-to-Many Relationships: A Cautionary Tale

In the baby names data, the name is not uniquely identifying. For example, there are both males and females with the name "Jessie".

In [14]:
jessie1995 = names1995[names1995["Name"] == "Jessie"]
jessie2015 = names2015[names2015["Name"] == "Jessie"]

jessie1995

         Name Sex  Count  Year
248    Jessie   F   1138  1995
16046  Jessie   M    903  1995

That is why we have to be sure to join on both name and sex. But what would go wrong if we joined these two `DataFrame`s on just "Name"? Let's try it out:

In [15]:
jessie1995.merge(jessie2015, on=["Name"])

     Name Sex_x  Count_x  Year_x Sex_y  Count_y  Year_y
0  Jessie     F     1138    1995     F      469    2015
1  Jessie     F     1138    1995     M      233    2015
2  Jessie     M      903    1995     F      469    2015
3  Jessie     M      903    1995     M      233    2015

We see that Jessie ends up appearing four times.

- Female Jessies from 1995 are matched with female Jessies from 2015. (Good!)
- Male Jessies from 1995 are matched with male Jessies from 2015. (Good!)
- Female Jessies from 1995 are matched with male Jessies from 2015. (Huh?)
- Male Jessies from 1995 are matched with female Jessies from 2015. (Huh?)

The problem is that there were multiple Jessies in the 1995 data and multiple Jessies in the 2015 data. We say that these two data sets have a **many-to-many relationship**.

# Joining Data

In the previous section, we discussed how to _merge_ (or _join_) two data sets by matching on certain variables. But what happens when no match can be found for a row in one `DataFrame`? 

First, let's determine how _pandas_ handles this situation by default. The name "Nevaeh", which is "Heaven" spelled backwards, is said to have taken off when Sonny Sandoval of the band P.O.D. gave his daughter the name in 2000. Let's look at how common this name was four years earlier and four years after.

In [16]:
names1996 = pd.read_csv("../data/names/yob1996.txt",
                        header=None,
                        names=["Name", "Sex", "Count"])
names2004 = pd.read_csv("../data/names/yob2004.txt",
                        header=None,
                        names=["Name", "Sex", "Count"])

In [17]:
names1996[names1996.Name == "Nevaeh"]

Empty DataFrame
Columns: [Name, Sex, Count]
Index: []

In [18]:
names2004[names2004.Name == "Nevaeh"]

         Name Sex  Count
103    Nevaeh   F   3179
21764  Nevaeh   M     35

In 1996, there were no girls (or fewer than 5) named Nevaeh; just eight years later, there were over 3000 girls (and 27 boys) with the name. It seems like Sonny Sandoval had a huge effect.

What will happen to the name "Nevaeh" when we merge the two data sets?

In [19]:
names = names1996.merge(names2004, on=["Name", "Sex"], suffixes=("1996", "2004"))
names[names.Name == "Nevaeh"]

Empty DataFrame
Columns: [Name, Sex, Count1996, Count2004]
Index: []

By default, _pandas_ only includes combinations that are present in _both_ `DataFrame`s. If it cannot find a match for a row in one `DataFrame`, then the combination is simply dropped.

But in this context, the fact that a name does not appear in one data set is informative. It means that no babies were born in that year with that name. (Technically, it means that fewer than 5 babies were born with that name, as any name that was assigned fewer than 5 times is omitted for privacy reasons.) We might want to include names that appeared in only one of the two `DataFrame`s, rather than just the names that appeared in both. 

There are four types of joins, distinguished by whether they include names from the left `DataFrame`, the right `DataFrame`, both, or neither:

1. **inner join** (default): only values that are present in _both_ `DataFrame`s are included in the result
2. **outer join**: any value that appears in _either_ `DataFrame` is included in the result
3. **left join**: any value that appears in the _left_ `DataFrame` is included in the result, whether or not it appears in the right `DataFrame`
4. **right join**: any value that appears in the _right_ `DataFrame` is included in the result, whether or not it appears in the left `DataFrame`.

In _pandas_, the join type is specified using the `how=` argument.

Now let's look at examples of each of these types of joins.

In [20]:
# inner join
names_inner = names1996.merge(names2004, on=["Name", "Sex"], how="inner", suffixes=("1996", "2004"))
names_inner.head()

       Name Sex  Count1996  Count2004
0     Emily   F      25151      25037
1   Jessica   F      24198       9470
2    Ashley   F      23677      14373
3     Sarah   F      21040      12737
4  Samantha   F      20548      13783

In [21]:
# outer join
names_outer = names1996.merge(names2004, on=["Name", "Sex"], how="outer", suffixes=("1996", "2004"))
names_outer.head()

       Name Sex  Count1996  Count2004
0     Emily   F    25151.0    25037.0
1   Jessica   F    24198.0     9470.0
2    Ashley   F    23677.0    14373.0
3     Sarah   F    21040.0    12737.0
4  Samantha   F    20548.0    13783.0

Names like "Zyrell" and "Zyron" appeared in the 2004 data but not the 1996 data. For this reason, their count in 1996 is `NaN`. In general, there will be `NaN`s in a `DataFrame` resulting from an outer join. Any time a name appears in one `DataFrame` but not the other, there will be `NaN`s in the columns from the `DataFrame` whose data is missing.

In [22]:
names_outer.isnull().sum()

Name             0
Sex              0
Count1996    11988
Count2004     6363
dtype: int64

By contrast, there are no `NaN`s when we do an inner join. That is because we restrict to only the (name, sex) pairs that appeared in both `DataFrame`s, so we have counts for both 1996 and 2014.

In [23]:
names_inner.isnull().sum()

Name         0
Sex          0
Count1996    0
Count2004    0
dtype: int64

Left and right joins preserve data from one `DataFrame` but not the other. For example, if we were trying to calculate the percentage change for each name from 1996 to 2004, we would want to include all of the names that appeared in the 1996 data. If the name did not appear in the 2004 data, then that is informative.

In [24]:
# left join
names_left = names1996.merge(names2004, on=["Name", "Sex"], how="left", suffixes=("1996", "2004"))
names_left.head()

       Name Sex  Count1996  Count2004
0     Emily   F      25151    25037.0
1   Jessica   F      24198     9470.0
2    Ashley   F      23677    14373.0
3     Sarah   F      21040    12737.0
4  Samantha   F      20548    13783.0

The result of a left join has `NaN`s in the column from the right `DataFrame`.

In [25]:
names_left.isnull().sum()

Name            0
Sex             0
Count1996       0
Count2004    6363
dtype: int64

The result of a right join, on the other hand, has `NaN`s in the column from the left `DataFrame`.

In [26]:
# right join
names_right = names1996.merge(names2004, on=["Name", "Sex"], how="right", suffixes=("1996", "2004"))
names_right.head()

      Name Sex  Count1996  Count2004
0    Emily   F    25151.0      25037
1     Emma   F     6144.0      21607
2  Madison   F    13410.0      20622
3   Olivia   F     8123.0      16105
4   Hannah   F    18596.0      15605

In [27]:
names_right.isnull().sum()

Name             0
Sex              0
Count1996    11988
Count2004        0
dtype: int64

One way to visualize the different types of joins is using Venn diagrams. The shaded circles specify which values are included in the output.

![](../images/joins.jpeg)

# Exercises

**Exercise 1.** Make a line plot showing the popularity of your name over the years.  Make sure you include all the years in the dataset!  You'll need to write some code to make sure you open **all** the year datafiles.

(**BONUS Extra Credit (2 points)**: As an added challenge, try marking the year you were born with a graphic element.)

(If you have a rare name that does not appear in the data set, choose a friend's name.)

In [39]:
data_M = []
data_F = []
columns = []
initString = 'yob'
df_names = pd.read_csv('../data/names/yob1880.txt',
                            header=None,
                            names=["Name", "Sex", "Count"])
df_names.set_index(["Name","Sex"], inplace=True)
for i in range(1880,2019):
    pathSTR = '../data/names/'+initString+str(i)+'.txt'
    new_data = pd.read_csv(pathSTR,
                            header=None,
                            names=["Name", "Sex", "Count"])
    new_data.set_index(["Name","Sex"], inplace=True)
    df_names = df_names.merge(new_data, on=["Name", "Sex"], how="outer")
    '''try:
        data_M.append(new_data.loc['Max','M']['Count'])
    except:
        data_M.append(0)
    try:
        data_F.append(new_data.loc['Max','F']['Count'])
    except:
        data_F.append(0)'''
df_names

C:\Users\MSend\anaconda3\envs\Capstone\lib\site-packages\pandas\core\frame.py:9190: FutureWarning: Passing 'suffixes' which cause duplicate columns {'Count_x'} in the result is deprecated and will raise a MergeError in a future version.
  return merge(

,,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y,Count_x,Count_y
Name,Sex,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
Mary,F,7065.0,7065.0,6919.0,8148.0,8012.0,9217.0,9128.0,9889.0,9888.0,11754.0,11648.0,12078.0,11703.0,13172.0,12784.0,13151.0,13446.0,13811.0,13413.0,14406.0,13172.0,16706.0,13136.0,14486.0,14275.0,14961.0,16067.0,16370.0,17580.0,18665.0,19259.0,22848.0,24390.0,32304.0,36642.0,45345.0,58187.0,61438.0,64281.0,67366.0,65838.0,70982.0,73985.0,72173.0,71638.0,73534.0,70591.0,67832.0,70639.0,66872.0,63508.0,64146.0,60296.0,59874.0,55509.0,56929.0,55069.0,54372.0,55645.0,56215.0,54901.0,56203.0,58040.0,63254.0,66169.0,62467.0,59283.0,67467.0,71687.0,68597.0,66864.0,65481.0,65721.0,65634.0,64379.0,68007.0,63165.0,61756.0,61094.0,55857.0,54474.0,51475.0,47680.0,43486.0,41550.0,40990.0,34270.0,28884.0,25313.0,21725.0,19851.0,19203.0,16697.0,13761.0,12316.0,11738.0,10967.0,10318.0,10659.0,10043.0,10561.0,11474.0,11045.0,10855.0,9897.0,9290.0,9244.0,8506.0,8395.0,8510.0,8644.0,8667.0,8760.0,8458.0,8120.0,7752.0,7455.0,6961.0,6644.0,6458.0,6374.0,6198.0,5732.0,5463.0,5017.0,4810.0,4459.0,4091.0,3686.0,3499.0,3163.0,2871.0,2706.0,2576.0,2651.0,2632.0,2631.0,2508.0,2402.0,2327.0
Anna,F,2604.0,2604.0,2698.0,3143.0,3306.0,3860.0,3994.0,4283.0,4227.0,4982.0,5062.0,5233.0,5099.0,5542.0,5695.0,5565.0,5950.0,5860.0,5429.0,5773.0,5115.0,6114.0,4923.0,5288.0,5098.0,5330.0,5424.0,5502.0,5575.0,5860.0,5804.0,6436.0,6753.0,8586.0,9687.0,11865.0,15119.0,15228.0,15160.0,15666.0,14498.0,14581.0,14477.0,13405.0,12864.0,13078.0,12250.0,11698.0,11215.0,10574.0,9751.0,9079.0,8430.0,7919.0,7074.0,6679.0,6163.0,5725.0,5449.0,5140.0,4931.0,4717.0,4430.0,4487.0,4232.0,3634.0,3607.0,3998.0,4240.0,4038.0,3896.0,3816.0,3868.0,3715.0,3837.0,3997.0,4093.0,4387.0,4445.0,4660.0,4878.0,4655.0,4670.0,4436.0,4249.0,4288.0,3920.0,3674.0,3722.0,3563.0,3716.0,3796.0,3576.0,3448.0,3499.0,3614.0,3570.0,3587.0,3852.0,4169.0,4666.0,5034.0,5190.0,5270.0,5218.0,5306.0,5882.0,5908.0,6166.0,6439.0,6896.0,7288.0,7118.0,6847.0,6808.0,7525.0,8566.0,8569.0,8340.0,8380.0,9104.0,10589.0,10580.0,10388.0,9447.0,9515.0,9102.0,8602.0,7893.0,7266.0,6804.0,6329.0,5663.0,5618.0,5380.0,5689.0,5130.0,4784.0,4544.0,4145.0
Emma,F,2003.0,2003.0,2034.0,2303.0,2367.0,2587.0,2728.0,2764.0,2647.0,3087.0,2884.0,2980.0,2884.0,3128.0,2968.0,2937.0,2952.0,2872.0,2698.0,2788.0,2445.0,3095.0,2374.0,2514.0,2308.0,2312.0,2298.0,2224.0,2356.0,2357.0,2338.0,2607.0,2616.0,3357.0,3474.0,3972.0,5044.0,5217.0,5121.0,5324.0,5087.0,5237.0,5073.0,5013.0,4976.0,4899.0,4713.0,4480.0,4326.0,4017.0,3803.0,3555.0,3307.0,3330.0,3150.0,2941.0,2802.0,2834.0,2748.0,2668.0,2685.0,2607.0,2545.0,2605.0,2423.0,2246.0,2052.0,2071.0,2142.0,2097.0,1999.0,1896.0,1729.0,1712.0,1589.0,1528.0,1461.0,1341.0,1214.0,1085.0,1057.0,980.0,888.0,797.0,723.0,770.0,639.0,619.0,564.0,491.0,515.0,527.0,473.0,453.0,419.0,493.0,478.0,414.0,478.0,444.0,489.0,532.0,534.0,563.0,552.0,676.0,945.0,1258.0,1588.0,1789.0,1935.0,2418.0,2593.0,3211.0,4104.0,4764.0,5045.0,6144.0,7742.0,10442.0,11730.0,12552.0,13308.0,16540.0,22706.0,21607.0,20344.0,19119.0,18373.0,18813.0,17895.0,17345.0,18803.0,20945.0,20942.0,20936.0,20455.0,19496.0,19800.0,18688.0
Elizabeth,F,1939.0,1939.0,1852.0,2186.0,2255.0,2549.0,2582.0,2680.0,2681.0,3224.0,3058.0,3112.0,3059.0,3461.0,3360.0,3425.0,3603.0,3471.0,3442.0,3659.0,3287.0,4096.0,3216.0,3694.0,3723.0,3833.0,4121.0,4321.0,4624.0,4904.0,5176.0,5800.0,6298.0,8528.0,9505.0,11367.0,14103.0,14939.0,15131.0,15853.0,15287.0,15910.0,15800.0,15242.0,15461.0,14951.0,13935.0,12835.0,12527.0,11763.0,11250.0,10996.0,10291.0,9996.0,9015.0,9346.0,9075.0,8860.0,9385.0,9800.0,9707.0,9952.0,10269.0,11182.0,11646.0,11033.0,10338.0,11753.0,13439.0,13212.0,13712.0,14335.0,15120.0,16022.0,16099.0,16580.0,16693.0,16345.0,17496.0,18530.0,18425.0,18858.0,18856.0,17801.0,17593.0,17292.0,16320.0,15884.0,16114.0,14886.0,15297.0,15119.0,13602.0,12185.0,12357.0,12261.0,12473.0,13546.0,16427.0,16808.0,18078.0,19528.0,20173.0,20514.0,19842.0,20364.0,20541.0,19072.0,18607.0,20038.0,20295.0,20744.0,20392.0,19032.0,17557.0,16782.0,16185.0,15998.0,15423.0,15187.0,15345.0,15099.0,14786.0,14604.0,14103.0,13561.0,12731.0,12428.0,13056.0,12008.0,11035.0,10262.0,10091.0,9708.0,9454.0,9564.0,9730.0,9555.0,8955.0,8513.0
Minnie,F,1746.0,1746.0,1653.0,2004.0,2035.0,2243.0,2178.0,2372.0,2215.0,2654.0,2624.0,2650.0,2428.0,2609.0,2510.0,2592.0,2567.0,2530.0,2284.0,2409.0,2036.0,2673.0,2026.0,2055.0,1846.0,1885.0,1950.0,1777.0,1907.0,1817.0,1779.0,1983.0,1899.0,2295.0,2332.0,2718.0,3270.0,3274.0,3262.0,3181.0,3272.0,3244.0,2998.0,3117.0,2784.0,2885.0,2738.0,2448.0,2469.0,2229.0,1994.0,2007.0,1770.0,1810.0,1603.0,1663.0,1582.0,1429.0,1378.0,1361.0,1268.0,1227.0,1355.0,1447.0,1346.0,1220.0,1088.0,1073.0,1050.0,994.0,934.0,876.0,793.0,695.0,658.0,612.0,547.0,497.0,417.0,414.0,424.0,349.0,320.0,272.0,245.0,223.0,208.0,181.0,175.0,155.0,138.0,126.0,134.0,115.0,108.0,104.0,95.0,83.0,69.0,59.0,73.0,71.0,56.0,45.0,53.0,44.0,63.0,34.0,45.0,44.0,33.0,38.0,37.0,55.0,24.0,37.0,28.0,36.0,30.0,35.0,24.0,31.0,25.0,33.0,25.0,27.0,32.0,37.0,17.0,43.0,28.0,38.0,39.0,45.0,58.0,49.0,68.0,65.0,67.0,66.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Zhiheng,M,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5.0
Ziaan,M,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5.0
Zihir,M,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5.0
Zin,M,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5.0
Zuber,M,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5.0

Exercises 2-4 deal with the [Movielens data 1M Dataset](https://grouplens.org/datasets/movielens/1m/) which has been copied into the Github for this class.  This dataset is a collection of movie ratings submitted by users. The information about the movies, ratings, and users are stored in three separate files, called `movies.dat`, `ratings.dat`, and `users.dat`. The column names are not included with the data files. Refer to the data documentation (`./data/movielens/README`) for the column names and how the columns correspond across the data sets.

For the first part of this excersize you need to open these datafiles, make sure the column headders are correct, and merge them into a single DataFrame to answer the questions.  Take note of the seperators in the data and maybe look at the documentation for [Pandas read_csv()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html) for some hits.

**Exercise 2.** Who's more generous with ratings: males or females? Calculate the average of the ratings given by male users, and the average of the ratings given by female users.

In [29]:
# TYPE YOUR CODE HERE

**Exercise 3.** Calculate the number of ratings for each of the movies. How many of the movies had zero ratings?

(_Hint_: You may need to use operations on the ratings table first.)

(_Hint_: Why is an inner join not sufficient here?)

In [30]:
# TYPE YOUR CODE HERE

**Exercise 4.** How many movies received both a 1 and a 5 rating? Do this by creating and joining two appropriate tables.

(*Hint:* The [Pandas unique()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.unique.html) function may be nice here...)

In [31]:
# TYPE YOUR CODE HERE

**Exercise 5.** Among movies with at least 100 ratings, which movie had the highest average rating? 

(**Hint:** Try filtering the dataframe before using other commands.)

In [32]:
# TYPE YOUR CODE HERE

**BONUS BONUS 8 POINTS.** For each movie, calculate the average age of the users who rated it and the average rating. Make a scatterplot showing the relationship between age and rating, with each point representing a movie. Use the size of each point to represent the number of users who rated the movie.

In [33]:
# TYPE YOUR CODE HERE

### When you have filled out all the questions, submit via [Tulane Canvas](https://tulane.instructure.com/)